---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipeDimension
source: html/d5f34e3c-19d8-8b90-7741-b8d610232349.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipeDimension Property

Pipe Dimension, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipeDimension { get; }
```